######WordStr VER 5.3.1######
##########BY  ZTREN##########
#———————————————————————————#
#THIS FILE IS FREE TO MODIFY#
############ENJOY!###########

GroupName = '跑网团'#跑团群群名
RCG = \
['cnm','sb','nmsl','傻逼','rnm','gck','爬','给爷爬','你说你马呢？','输的啥心里没丶ACD数？']#random curse generator
YYY = \
['干嘛戳我Q_Q','不要戳了啦！TAT','再戳就生气了！','干嘛QwQ','嘤','QwQ','TAT','呜呜呜他欺负我','坏人走开']#嘤嘤嘤
DRM = \
['昂？','爷佛了','啥啊','这是ao的','啊？','#¥…#¥!@#','搜到有','爬']#梦话
hlp = \
'——CRISPY使用指南——\n\
CRISPY ver5.3.1 "PETRAM"\n\
目前本机.和。通用，已经开发的功能有：\n\
.rd [text] = [因为text]投掷1D100的一颗骰子\n\
.rXdY [text] = [因为text]投掷XDY的一颗骰子\n\
.rb/rp [n] = 投掷n个奖励骰/惩罚骰\n\
.ra/rc <x> [text] = [因为text]投掷以x为成功线的检定\n\
.rhd [text] = [因为text]暗骰1D100\n\
.nn [name] = 将自己在骰子中显示的昵称改为name，若[name]为空则还原默认群昵称\n\
.复读 [msg] = 让骰子复读你的话//可以用来做语录\n\
.jrrp = 今日人品（1d100到10以下-1，90以上+1，不包含加减）\n\
.reg 详细见 .help reg\n\
注：[]内为选填，<>内为必填\n\
*MUTE(UNMUTE)* = 将本bot禁言或解除禁言\n\
*TIMER ON(OFF)* = 开启或关闭自动唤醒，默认关闭\n\
*EXIT* = 关闭本bot\n\
*RPT ON(OFF)* = 开启或关闭随机复读功能\n\
目前随机复读状态为：\
'
reghlp = \
'——REG功能使用指南——\n\
.reg all = 根据。coc填出来的卡读入，第一行需为STR\n\
.reg <XXX> <数据> = 人物卡数据填写（如AGG 65）\n\
.reg <XXX+改变量> = 人物卡数据改变（如AGG+1）\n\
.reg list = 显示你的人物卡\n\
'
RegSuc = \
'人物卡注册成功了的说。'
InputReg = \
'告诉我你的人物卡数据吧(o^^o)'#输入人物卡数据
DelReg = \
'人物卡数据被清空了！'#清空人物卡数据
NotRegistered = \
'{0}，你好像并没有注册人物卡呀(･_･;'#人物卡未注册
ListCRD = \
'以下是 {0} 的人物卡数据！'#列出人物卡数据
CRDStatus =  \
'{0}，你的{1}目前的数值为：{2}'#显示人物卡数值
CRDUpd = \
'{0}的{1}数值已经更新为{2}啦_(:з」∠)_'#更新人物卡数值
CRDChange = \
'{0}的{1}数值要改变？唔好的：\n{2} → {3}'#改变人物卡数值
UnitNotFound = \
'并没有找到你所说的单位啊(･_･;'#单位未找到
Jrrp = \
'{0}，你在{1}的人品为：{2}！\n试试。rd提升人品吧！'#今日人品
NN = \
'啊，那之后就把你叫做 {0} 了昂'#自定义名称
NNForget = \
'让我忘掉 {0} 这个称号？好啊'#忘掉自定义名称
RPT = \
'已{0}随机对话！'#开/关随机对话
EmptyRpt = \
['耍我啊？','干啥啊']#。复读内容为空
COC = \
'{0}酱，这是新的调查员数据\n'#roll人物卡数据
RBP = \
'{0} 骰出了 {1}={2}[{3}骰：{4}]={5}'#奖励骰/惩罚骰
RBPn = \
'因为{0}检定，{1} 骰出了 {2}={3}[{4}骰：{5}]={6}'#由于某检定而进行的奖励骰/惩罚骰
RHDGroup = \
'CRISPY正在暗骰……'#暗骰时在群中的提示
RHD = \
'暗骰结果是：{0}'#暗骰结果
RHDn = \
'在{0}的检定中的暗骰结果是：{1}'#由于某检定而进行的暗骰
RHDLine = \
'——[Doge]——'#暗骰分割线，用于遮挡微信主界面显示的数据。若不需要则填''
RPChange = \
'{0}的今日人品变动！现在是：{1}！'#今日人品因rd变动
ROLL = \
'{0} 骰出了 {1}d{2}={3}{4}'#骰子
ROLLn = \
'由于 {0} 检定，{1}骰出了 {2}d{3}={4}{5}'#由于某检定而进行的骰子
Repeat = \
'{0}\n——{1}'#复读
EN = \
'{0}想要通过骰点来获得一些{1}上的成长？来，让我们看看——\n原有{1}：{2}\n1D100 = {3}\n{4}'#成长检定
RC = \
'{0}似乎想要通过{1}检定来解决问题呢：\n1D100 = {2}\n{3}'#检定
Suc = \
'成功了呢，祝贺'#成功提示
HardSuc = \
'困难成功，今天的运气不错哦？'#困难成功提示
ExtremeSuc = \
'极难成功，期待你的表现~'#极难成功提示
GSuc = \
'是大成功？？真令人难以置信，不愧是你'
Fail = \
'失败了的说，抱歉哦'#失败提示
LFail = \
'是大失败哦？生死有命富贵在天啊'#大失败提示
Muted = \
'嗯？好的，那我就不说话了唔'#禁言
Unmuted = \
'可以说话了？好的哦'#解除禁烟
TimerOn = \
'定时唤醒开启了，这样我晚上就不会睡的醒不来了'#自动唤醒开
TimerOff = \
'定时唤醒关闭了，第二天睡不醒别怪我'#自动唤醒关
Hello = \
''#开启程序时的问候语
Farewell = \
'那么，晚安'#关闭程序时的语句
Err = \
'输入格式好像不太对的说'#输入有误
